#+TITLE: Introduction to Literate Programming
#+URL: http://howardism.org/Technical/Emacs/literate-programming-tutorial.html                              
#+AUTHOR: lujun9972
#+CATEGORY: raw
#+DATE: [2016-06-23 四 17:59]
#+OPTIONS: ^:{}

欢迎来到文学编程的世界! 本文会简单介绍一下如何使用org-mode进行文学编程

本文的内容来源于PDX Emacs Hackers举办的研讨会, 但是考虑到很少人能够现场参加该研讨会,因此我决定把它写成一片指南. 我假设你已经有了一定的[[http://howardism.org/Technical/Emacs/getting-started.html][Emacs基础]] 并且对[[http://howardism.org/Technical/Emacs/learning-org-mode.html][org-mode也比较熟悉]] ,至少知道如何导出文档.

众所周知,Org的功能太多了, 它具有在一个文档中编写,执行和连接代码块的能力,这种能力 are extensive, 要把这些功能都写成文档是件让人感觉恐怖的任务. 我希望这份指南能开个好头, 若你发现我遗漏了什么,请[[http://howardism.org/formmail/mail?to=howardism][告之]].

*警告* :下面的例子都写得很蹩脚.

*** Session

Each block re-starts its interpreter every time you evaluate a block. Use the [[http://orgmode.org/org.html#session][:session]] header parameter as a
label and have all blocks with that label use the same session. Why? Some issues with restarting your session
include:

  * Large start-up time with large REPLs … like Clojure
  * Large start-up time on remote machines using Tramp
  * Maintaining functions and other state between blocks

Note: Values can be passed between code blocks, so this last feature isn’t necessary.

To show that interpreters are restarted with each block:

#+BEGIN_SRC org
  ,#+BEGIN_SRC python
    avar = 42
    return avar
  ,#+END_SRC

  ,#+RESULTS:
  : 42

  ,#+BEGIN_SRC python
    return avar / 2
  ,#+END_SRC

  ,#+RESULTS:
  NameError: global name 'avar' is not defined
#+END_SRC

To prove that :session-based interpreters are not restarted with each block:

#+BEGIN_SRC ruby :session foobar
  avar = 42
#+END_SRC

#+RESULTS:
: 42

#+BEGIN_SRC ruby :session foobar
  avar / 2
#+END_SRC

#+RESULTS:
: 21

The :session is good to set as a section property. Also note that you can switch to the *foobar* buffer to
interact with the interpreter, set variables and other state before evaluating the code block.

What’s wrong with the following?

#+BEGIN_SRC org
  ,* Confusing Stuff
  :PROPERTIES:
  :session:  stateful
  :END:

  ,#+BEGIN_SRC sh :results silent
    NUM_USERS=$(grep 'bash' /etc/passwd | wc -l --)
  ,#+END_SRC

  We have access to them:
  ,#+BEGIN_SRC sh
    echo $NUM_USERS
  ,#+END_SRC

  ,#+RESULTS:
  : 2

  This doesn't return... why?
  ,#+BEGIN_SRC ruby
    21 * 2
  ,#+END_SRC
#+END_SRC

*Warning*: A :session setting for a section is shared for each block… regardless of language! Probably not what
you want.

